Ran Plan for 4 projects:

1. project: `authhub-ecr-stage` dir: `terraform/environments/stage/ecr` workspace: `default`
1. project: `authhub-ecs-cluster-stage` dir: `terraform/environments/stage/ecs-cluster` workspace: `default`
1. project: `authhub-elasticache-stage` dir: `terraform/environments/stage/elasticache` workspace: `default`
1. project: `authhub-ecs-web-api-stage` dir: `terraform/environments/stage/ecs-web-api` workspace: `default`
---

### 1. project: `authhub-ecr-stage` dir: `terraform/environments/stage/ecr` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p authhub-ecr-stage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FAuthHub%252Fterraform%252Fenvironments%252Fstage%252Fecr%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p authhub-ecr-stage
  ```

---
### 2. project: `authhub-ecs-cluster-stage` dir: `terraform/environments/stage/ecs-cluster` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p authhub-ecs-cluster-stage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FAuthHub%252Fterraform%252Fenvironments%252Fstage%252Fecs-cluster%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p authhub-ecs-cluster-stage
  ```

---
### 3. project: `authhub-elasticache-stage` dir: `terraform/environments/stage/elasticache` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_security_group.redis will be updated in-place
~ resource "aws_security_group" "redis" {
        id                     = "sg-0fef8c9c7b05e5b45"
        name                   = "authhub-redis-sg-staging"
      + revoke_rules_on_delete = false
      ~ tags                   = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
          + "Environment" = "staging"
            "Lifecycle"   = "staging"
          + "ManagedBy"   = "terraform"
            "Name"        = "authhub-redis-sg-staging"
            "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "authhub"
            "Service"     = "authhub-redis"
        }
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ vpc_id                 = (sensitive value)
        # (7 unchanged attributes hidden)
    }

  # aws_ssm_parameter.redis_endpoint will be created
+ resource "aws_ssm_parameter" "redis_endpoint" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "AuthHub Redis endpoint (staging)"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/authhub/staging/elasticache/redis-endpoint"
      + tags           = {
          + "Environment" = "staging"
          + "Name"        = "authhub-redis-endpoint-staging"
        }
      + tags_all       = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "authhub-redis-endpoint-staging"
          + "Project"     = "authhub"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.redis_port will be created
+ resource "aws_ssm_parameter" "redis_port" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "AuthHub Redis port (staging)"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/authhub/staging/elasticache/redis-port"
      + tags           = {
          + "Environment" = "staging"
          + "Name"        = "authhub-redis-port-staging"
        }
      + tags_all       = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "authhub-redis-port-staging"
          + "Project"     = "authhub"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.redis.aws_elasticache_cluster.memcached-or-single-redis[0] will be created
+ resource "aws_elasticache_cluster" "memcached-or-single-redis" {
      + apply_immediately          = false
      + arn                        = (known after apply)
      + auto_minor_version_upgrade = "true"
      + availability_zone          = (known after apply)
      + az_mode                    = "single-az"
      + cache_nodes                = (known after apply)
      + cluster_address            = (known after apply)
      + cluster_id                 = "authhub-redis-staging"
      + configuration_endpoint     = (known after apply)
      + engine                     = "redis"
      + engine_version             = "7.0"
      + engine_version_actual      = (known after apply)
      + id                         = (known after apply)
      + ip_discovery               = (known after apply)
      + maintenance_window         = "mon:09:00-mon:10:00"
      + network_type               = (known after apply)
      + node_type                  = "cache.t3.micro"
      + num_cache_nodes            = 1
      + parameter_group_name       = "authhub-redis-staging-parameter-group"
      + port                       = 6379
      + preferred_outpost_arn      = (known after apply)
      + replication_group_id       = (known after apply)
      + security_group_ids         = [
          + "sg-0fef8c9c7b05e5b45",
        ]
      + snapshot_retention_limit   = 0
      + snapshot_window            = "03:00-04:00"
      + subnet_group_name          = "authhub-redis-staging-subnet-group"
      + tags                       = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "staging"
          + "Lifecycle"   = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "authhub-redis-staging"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "authhub"
          + "Service"     = "authhub-redis"
        }
      + tags_all                   = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "staging"
          + "Lifecycle"   = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "authhub-redis-staging"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "authhub"
          + "Service"     = "authhub-redis"
        }
      + transit_encryption_enabled = (known after apply)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

Changes to Outputs:
+ cluster_id              = "authhub-redis-staging"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p authhub-elasticache-stage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FAuthHub%252Fterraform%252Fenvironments%252Fstage%252Felasticache%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p authhub-elasticache-stage
  ```
Plan: 3 to add, 1 to change, 0 to destroy.

---
### 4. project: `authhub-ecs-web-api-stage` dir: `terraform/environments/stage/ecs-web-api` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs_service.aws_ecs_service.this will be updated in-place
~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/authhub-cluster-staging/authhub-web-api-staging"
        name                               = "authhub-web-api-staging"
        tags                               = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS service for authhub-web-api-staging"
            "Environment" = "staging"
            "Lifecycle"   = "staging"
            "ManagedBy"   = "terraform"
            "Name"        = "authhub-web-api-staging"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "authhub"
            "Service"     = "authhub-web-api"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/authhub-web-api-staging:17" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs_service.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/authhub-web-api-staging:16" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/authhub-web-api-staging" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "authhub-web-api-staging" -> (known after apply)
      ~ revision                 = 16 -> (known after apply)
        tags                     = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS task definition for authhub-web-api-staging"
            "Environment" = "staging"
            "Lifecycle"   = "staging"
            "ManagedBy"   = "terraform"
            "Name"        = "authhub-web-api-staging"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "authhub"
            "Service"     = "authhub-web-api"
        }
        # (12 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
~ task_definition_arn    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/authhub-web-api-staging:16" -> (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p authhub-ecs-web-api-stage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FAuthHub%252Fterraform%252Fenvironments%252Fstage%252Fecs-web-api%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p authhub-ecs-web-api-stage
  ```
Plan: 1 to add, 1 to change, 1 to destroy.

---
### Plan Summary

4 projects, 2 with changes, 2 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```